# Tap Brews

tap "asmvik/formulae"
tap "charmbracelet/tap"
tap "coder/coder"
tap "d12frosted/emacs-plus"
tap "deskflow/tap"
tap "dotenvx/brew"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "localstack/tap"
tap "minio/stable"
tap "moncho/dry"
tap "nikitabobko/tap"
tap "nocodb/nocodb"
tap "pulumi/tap"
tap "railwaycat/emacsmacport"
tap "shivammathur/extensions"
tap "shivammathur/php"
tap "symfony-cli/tap"

# Install packages
# @TODO Filter and organize per category
brew "jpeg-xl"
brew "aom"
brew "autoconf"
brew "automake"
brew "libsodium"
brew "aws-elasticbeanstalk"
brew "bash"
brew "bison"
brew "blueutil"
brew "freetype"
brew "glib"
brew "claude-squad"
brew "lima"
brew "colima"
brew "gmp"
brew "coreutils"
brew "curl"
brew "deno"
brew "direnv"
brew "dry"
brew "erlang"
brew "elixir"
brew "eza"
brew "harfbuzz"
brew "icu4c@77"
brew "ffmpeg"
brew "firefoxpwa"
brew "fish"
brew "fontforge"
brew "gd"
brew "node"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-lfs"
brew "glow"
brew "golangci-lint"
brew "grep"
brew "helix"
brew "httpie", link: false
brew "imagemagick"
brew "jpeg"
brew "just"
brew "krb5"
brew "libedit"
brew "libiconv"
brew "libxml2"
brew "libzip"
brew "minio"
brew "mkcert"
brew "mydumper"
brew "zlib"
brew "mysql-client"
brew "nss"
brew "nushell"
brew "nvm"
brew "oniguruma"
brew "openjdk"
brew "pipx"
brew "pkgconf"
brew "re2c"
brew "ripgrep"
brew "saml2aws"
brew "starship"
brew "subversion"
brew "terragrunt"
brew "tmux"
brew "weechat"
brew "wtfutil"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "asmvik/formulae/skhd"
brew "asmvik/formulae/yabai"
brew "charmbracelet/tap/crush"
brew "coder/coder/coder"
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-savchenkovaleriy-big-sur-curvy-3d-icon"]
brew "dotenvx/brew/dotenvx"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "hashicorp/tap/terraform"
brew "jesseduffield/lazydocker/lazydocker"
brew "localstack/tap/localstack-cli"
brew "lua"
brew "minio/stable/mc"
brew "nocodb/nocodb/nocodb"
brew "pulumi/tap/pulumi"
brew "symfony-cli/tap/symfony-cli"
cask "1password"
cask "1password-cli"
cask "nikitabobko/tap/aerospace"
cask "android-platform-tools"
cask "arc"
cask "caffeine"
cask "deskflow/tap/deskflow"
cask "docker-desktop"
cask "firefox"
cask "fleet"
cask "flox"
cask "font-0xproto-nerd-font"
cask "font-cascadia-code"
cask "font-commit-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sketchybar-app-font"
cask "fontforge-app"
cask "gimp"
cask "github"
cask "google-chrome"
cask "gpg-suite"
cask "hammerspoon"
cask "httpie-desktop"
cask "karabiner-elements"
cask "microsoft-auto-update"
cask "monitorcontrol"
cask "notion"
cask "orbstack"
cask "phpstorm"
cask "polypane"
cask "proton-drive"
cask "proton-mail"
cask "proton-pass"
cask "raycast"
cask "rio"
cask "setapp"
cask "sf-symbols"
cask "slack"
cask "spotify"
cask "the-unarchiver"
cask "tinkerwell"
cask "visual-studio-code"
cask "webex"
cask "wezterm"
cask "zettlr"
cask "zoom"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "antfu.slidev"
vscode "astro-build.astro-vscode"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "codingyu.laravel-goto-view"
vscode "damms005.devdb"
vscode "docker.docker"
vscode "drcika.apc-extension"
vscode "editorconfig.editorconfig"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "glitchbl.laravel-create-view"
vscode "golang.go"
vscode "ihunte.laravel-blade-wrapper"
vscode "jakebecker.elixir-ls"
vscode "jcs090218.ellsp"
vscode "mattn.lisp"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "naoray.laravel-goto-components"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel-extension-pack"
vscode "onecentlin.laravel5-snippets"
vscode "pgl.laravel-jump-controller"
vscode "phoenixframework.phoenix"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "premparihar.gotestexplorer"
vscode "ryannaddy.laravel-artisan"
vscode "shufo.vscode-blade-formatter"
vscode "tinkertrain.theme-panda"
vscode "vue.volar"
vscode "xdebug.php-debug"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
cargo "airshipper"
cargo "loco"
cargo "paneru"
cargo "sea-orm-cli"
